#include <stdio.h>
int main()
{
    char a[]={1,2,3,4,5};//a[0]a[1]a[2]a[3]a[4]  如果我们定义了一个长度超过元素个数的数组,那么剩下的用零来填充
    char *p = a;//大部分时候,数组名a会在指针使用时退化为第一个数组元素的指针,此时p指向a[0],当然p[0]指向a[0]
    char *p2 = &a[4];//对于数组元素来说&取地址符是不可以少的,a[i]数据类型为整数型
    printf("%d\n",*p);//结果为1
    printf("%d\n",*(p+1));//结果为2,p+1指向了a[1]
    printf("%d",*p2);

//这三种写法都可以定义字符串(字符串数组),但指针b的字符串不能写,只读,相当于定义的是字符常量,
//另一个有趣的现象,当你的两个字符串指针指向的字符串相同时,那他们指针是一样的
    //char  b[] = "hello";
    //char *b   = "hello";
    //char *a   = "hello";
    //char  b[6]= "hello";//b[0]='h',b[1]='e' ......b[5]='\0'

    //printf("%d",b[5]);
}  